IDEA Open Model
PatchSupport Properties
Compatible with IDEA StatiCa v 10.1
The PatchSupport type exposes the following members.
Properties
Name | Description
GeomId
 Id representing geometrical parts of Detail
 (Inherited from PatchDevice.)
Id
 Element Id
 (Inherited from OpenElementId.)
MasterComponent
 Master component
 (Inherited from PatchDevice.)
MasterPoint
 Master point 0 - 9
 (Inherited from PatchDevice.)
Position
 Offset between MasterPoint and patch support/load
 (Inherited from PatchDevice.)
Top
See Also
Reference
PatchSupport Class
IdeaRS.OpenModel.Detail Namespace